{
  "experience": [
    {
      "title": "Staff UX Engineer",
      "subtitle": "FireEye, Inc. - Remote",
      "content": "Technical lead & developer on the FireEye UX team for the FireEye Design System (Muse) and supporting systems/adopters. Muse serves as the source of styled patterns and components for all FireEye's internal and public web applications. The project utilizes web components that are portable to both React and Angular projects as well as supported in almost all major browsers.",
      "details": [
        "Researching, prototyping and delivering project design and architectural decisions.",
        "Developing reusable web components as well as design patterns for the foundation of the Muse monorepo project.",
        "Collaborating with other teams to gain insight into future requirements and contributions for further adoption of the Muse Design System."
      ],
      "dates": "AUG 2019 - PRESENT"
    },
    {
      "title": "Senior Full-Stack Web Developer",
      "subtitle": "FireEye, Inc. - Remote",
      "content": "Full-stack Ruby on Rails and React developer on the Managed Defense engineering team for our two customer facing service and intelligence portals, MD Portal & FIP, as well as our internal unified analyst console, UAC.",
      "details": [
        "Drove and supported project design and architectural decisions.",
        "Provided ongoing maintenance and feature development utilizing Ruby on Rails, React.js, and other supporting tech such as Redux, GraphQL, Elastic Search, and Docker.",
        "Onboard and mentored new coworkers and bringing others up to speed on adopted tech.",
        "Supported and improved upon the deployment of our applications."
      ],
      "dates": "JUN 2015 - AUG 2019"
    },
    {
      "title": "Software Engineer",
      "subtitle": "CACI - Dahlgren, VA",
      "content": "Contributed to and completed multiple short and long term federal contracts as a software engineer and full stack web developer for the Naval Surface Warfare Center, Dahlgren Division (NSWCDD).",
      "details": [
        "Involved in the formation and member of the first Scrum team for the Targeting Message Media Maker (TM3) Java GUI project.",
        "Developed the frontend for the Weather Reentry Interaction Planner (WRIP) web application in vanilla JavaScript and delivered the project  in under 6 months.",
        "Introduced gamification to the Talent Manager Dashboard (TMD) Java web application via unlockable custom badges and achievements."
      ],
      "dates": "MAR 2014 - MAY 2015"
    },
    {
      "title": "Computer Science Department Lab Aide",
      "subtitle": "UMW - Fredericksburg, VA",
      "content": "Assisted students with computer science related inquiries, as well as provided IT support to the Unix and Windows Lab.",
      "dates": "MAY 2013 - MAY 2014"
    },
    {
      "title": "Computer Science Tutor",
      "subtitle": "UMW - Fredericksburg, VA",
      "content": "Tutored introductory and mid-level classes using Python, Java, and C++. Classes included Introduction to Computer Science, Problem-solving and Algorithmic Development, Data Structures, and Object-Oriented Analysis and Design.",
      "dates": "OCT 2013 - JAN 2014"
    }
  ]
}
